-- Пользователи
INSERT INTO "ToDoUser" ("TelegramUserId", "TelegramUserName")
VALUES 
    (10001, 'Алиса'),
    (10002, 'Макс');*/
-- Списки задач
INSERT INTO "ToDoList" ("UserId", "Title")
VALUES
    (1, 'Задачи'),
    (2, 'Цели');

--Задачи
INSERT INTO "ToDoItem" ("UserId", "ListId", "Title", "Description", "State", "Deadline")
VALUES
   (1, 1, 'Заколнчить проект', 'Сделать отчет', 1, '2025-08-30 18:00:00'),
   (1, 1, 'Подготовить слайды', 'Презентация в понедельник', 0, '2025-08-25 10:00:00'),
   (2, 2, 'Пойти в зал', 'Кардио тренировка', 2, '2025-08-17 19:00:00'),
   (2, 2, 'Купить продукты', 'Молоко, хлеб, овощи', 0, '2025-08-19 17:00:00');

